<!-- dflook/terraform-github-actions {"workspace":"docs-gen","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"116fe25ed7b0c0003eeedc01844648cd380b2639fc427eac100541d162131de6","plan_job_ref":"Job Test actions using target and replace #457 at https://github.com/dflook/terraform-github-actions/actions/runs/13548761048","plan_hash":"597ef59e981810fad43f3075b65e7c509d58d67677715ee78349bfadb0564fb4","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __docs-gen__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "iu1eWBUiAN" -> (known after apply)
!~  foreach = "7tCncXAfeK" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #457](https://github.com/dflook/terraform-github-actions/actions/runs/13548761048)